public class Main {
  public static void main(String[] args)
  {
System.out.print("a = 1 \n b = a \n a2 = ab \n a2 - b2 = ab - b2 \n (a+b)(a-b) = b(a-b) \n (a+b) = b \r a=b therefore \n \t \b b+b=b \r 2b = b \n Divide by B and we get \n \f 2=1");
System.out.println("☀︎☁︎☂︎☃︎☄︎★☆☊☋☍☎︎☏☐☑︎☒☓☔︎☕︎☘︎☚☛☜☝︎☞☟☠︎☢︎☣︎☭☮︎☸︎☹︎☺︎☻☼☽☾♔♕♖♗♘♙♚♜♜♝♞♟︎♠︎♡♢♣︎♤♥︎♦︎♧⚀⚁⚂⚃⚄⚅♿︎⚛︎⚓︎𓃗𓃘𓃙𓃚𓃛𓃹𓄄𓃟𓄂𓄚𓅓𓅔𓅜𓆉𓈝𓉚𓉛⬅︎⬆︎⬇︎⬒⬓⬔⬕⬖⬗⬘⬙⬚⮐⮑⍟⌘⌚︎⌛︎⌖⤴︎⤵︎⤶⤷⤹⥢⥣⥤⥥⇠⇡⇢⇣⇱⇲▀▁▂▃▄▅▆▇█▉▊▋▌▍▎▏▐░▒▓▔▕▖▗▘▙▚▛▜▝▞▟￦✁✁✃✄✆✈︎✉︎✌︎✍︎✎✏︎✐✓✔︎✕✖︎✗✘✧✩✪✫✬✭✮✯✰❤︎❖❶❷❸❹❺❻❼❽❾❿❿➀➁➂➃➄➅➆➇➈➉➊➋➌➍➎➏➐➑➒➓➠ \r math b like \f");
  }
}